Repository: weblate/visualization.shadertoy
Catalog: visualization.shadertoy/resources/language/resource.language.*/strings.po
Languages: es_es

# Addon Summary
source: Visualizations from Shadertoy
es_es: Visualizaciones de Shadertoy

# Addon Description
source: This music visualization is based on Shadertoy based GPU programs.
es_es: Esta visualización musical se basa en programas de GPU basados en Shadertoy.

# #30010
source: Choose one yourself
es_es: Elige uno tú mismo

# #30011
source: Use your own shadertoy. Attention: Some shaders are not supported by some GPU's in performance!
es_es: Utiliza tu propio shadertoy. ¡Atención: Algunos sombreadores no son compatibles con el rendimiento de algunas GPU!

# #30012
source: Shadertoy file
es_es: Archivo Shadertoy

# #30013
source: Shader as *.glsl
es_es: Sombreador como *.glsl

# #30014
source: Channel 0 as audio
es_es: Canal 0 como audio

# #30015
source: Use audio stream data on channel 0
es_es: Utilizar datos del canal de audio en el canal 0

# #30016
source: Channel 0 texture image
es_es: Imagen de textura del canal 0

# #30017
source: Channel 0 as *.png
es_es: Canal 0 como *.png

# #30018
source: Channel 1 as audio
es_es: Canal 1 como audio

# #30019
source: Use audio stream data on channel 1
es_es: Utiliza flujo de datos de audio en el canal 1

# #30020
source: Channel 1 texture image
es_es: Imagen de textura del canal 1

# #30021
source: Channel 1 as *.png
es_es: Canal 1 como *.png

# #30022
source: Channel 2 as audio
es_es: Canal 2 como audio

# #30023
source: Use audio stream data on channel 2
es_es: Utiliza flujo de datos de audio en el canal 2

# #30024
source: Channel 2 texture image
es_es: Imagen de textura del canal 2

# #30025
source: Channel 2 as *.png
es_es: Canal 2 como *.png

# #30026
source: Channel 3 as audio
es_es: Canal 3 como audio

# #30027
source: Use audio stream data on channel 3
es_es: Utiliza flujo de datos de audio en el canal 3

# #30028
source: Channel 3 texture image
es_es: Imagen de textura del canal 3

# #30029
source: Channel 3 as *.png
es_es: Canal 3 como *.png

# #30030
source: Shadertoy Visualization
es_es: Visualización Shadertoy

# #30031
source: Cannot read the JSON file. Please check the formatting is correct and the file is available.
es_es: No se puede leer el archivo JSON. Compruebe que el formato es correcto y que el archivo está disponible.

# #30032
source: Path to custom preset list
es_es: Ruta a la lista de ajustes preestablecidos personalizados

# #30033
source: Set the path to your custom JSON-formatted preset file. If no path is configured, the add-on will use the default preset file.
es_es: Establezca la ruta de su archivo de ajustes preestablecidos personalizado con formato JSON. Si no se configura ninguna ruta, el complemento utilizará el archivo de ajustes preestablecidos por defecto.

# #30034
source: Configure a single shader
es_es: Configurar un único sombreador

# #30035
source: Show help about preset file
es_es: Mostrar ayuda sobre el archivo de ajustes preestablecidos

# #30036
source: Open to read about creating the JSON-formatted preset file.
es_es: Abrir para leer sobre la creación del archivo preestablecido con formato JSON.

# #30037
source: Help about defining your own shaders in the JSON file
es_es: Ayuda sobre cómo definir tus propios sombreadores en el archivo JSON

# #30038
source: [B][I]JSON file for user defined shader lists[/I][/B] The file [B]presets.json[/B] is used to define custom shaders. A custom path to the shader files (GLSL) can be declared in the add-on settings. Contents of [B]presets.json[/B] should be: [I] 1.[/I] Name of preset. Either hardcoded string or defined in [I]resources/language/.../strings.po[/I] [I] 2.[/I] GLSL shader to use. If no custom path was declared, the default [B]resources/[/B] will be used. Set custom path to './' to use shaders from the same path as your [B]presets.json[/B] file. [I] 3.[/I] Channel value 0. Defines the texture to use (e.g. PNG file). Can also be set to "audio" to pass related stream data within texture. The PNG and GLSL files should be located in the same directory. [I] 4.[/I] Channel value 1 definition. [I] 5.[/I] Channel value 2 definition. [I] 6.[/I] Channel value 3 definition. [I] 7.[/I] [I][Optional][/I] append string [B]"gl_only"[/B] to make this preset only available to OpenGL. [B]Example:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Default way used by the addon itself */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Description defined in strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Define custom file paths */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Preset only available to OpenGL (see 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL and PNG files are in the same folder as presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Select texture image by file name, use default "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
es_es: [B][I]Archivo JSON para listas de sombreadores definidas por el usuario[/I][/B] El archivo [B]presets.json[/B] se utiliza para definir sombreadores personalizados. Se puede declarar una ruta personalizada a los archivos de sombreado (GLSL) en los ajustes del complemento. El contenido de [B]presets.json[/B] debería ser: [I] 1.[/I] Nombre del ajuste preestablecido. Cadena codificada o definida en [I]resources/language/.../strings.po[/I] [I] 2.[/I] Sombreador GLSL a utilizar. Si no se ha declarado ninguna ruta personalizada, se utilizará la predeterminada [B]resources/[/B]. Establece la ruta personalizada en './' para utilizar sombreadores de la misma ruta que tu archivo [B]presets.json[/B]. [I] 3.[/I] Valor del canal 0. Define la textura a utilizar (ej. archivo PNG). También se puede establecer a "audio" para pasar datos de flujo relacionados dentro de la textura. Los archivos PNG y GLSL deben estar en el mismo directorio. [I] 4.[/I] Definición del valor del canal 1. [I] 5.[/I] Definición del valor del canal 2. [I] 6.[/I] Definición del valor del canal 3. [I] 7.[/I] [I][Opcional][/I] añade la cadena [B]"gl_only"[/B] para que este ajuste preestablecido solo esté disponible para OpenGL. [B]Ejemplo:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"ajuste preestablecido"[/COLOR]:[ [COLOR gray]/* Modo por defecto utilizado por el propio addon */[/COLOR] [ [COLOR red]"The Disco Tunnel por poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Descripción definida en strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Definir rutas de archivo personalizadas */[/COLOR] [ [COLOR red]"La mía"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Ajuste preestablecido solo disponible para OpenGL (véase 7) */[/COLOR] [ [COLOR red]"Polar Beats por sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* Los archivos GLSL y PNG están en la misma carpeta que presets.json */[/COLOR] [ [COLOR red]"Otro más"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Seleccione la imagen de textura por nombre de archivo, utilice el directorio por defecto "resources/" */[/COLOR] [ [COLOR red]"Fractal Land de Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
